
/*

10/12/2015

Course work for UNIBIT - IT1 - OP
Had to be heavily commented.

*/

// Включваме необходимите библиотеки
#include <iostream>

// За да не се налага да пишем std:: всеки път
using namespace std;

// Функция, която проверява дали трябва да се изведе число или интервал.
// Ако номерът на сегашния ред, който се принтира е по-малък или равен от числото по ред се извежда число
void pr(int lines, int i)
{
	if (lines <= i)
		cout << i << " ";
	else cout << "  ";
}

// Главната функция на програмата
int main()
{
	// Цикъл за горната половина
	for (int lines = 1; lines < 4; lines++)
	{
		for (int i = 1; i < 5; i++) pr(lines, i); // Минава през числата 1 - 4 и извежда възоснова на правилото на функцията pr()
		for (int i = 4; i > 0; i--) pr(lines, i); // Същото като горния ред, но за дясната страна на обърнатата пирамида
		cout << endl; // Минаваме на нов ред
	}

	// Цикъл за долната половина
	for (int lines = 4; lines > 0; lines--)
	{
		// Тъй като просто обърнахме реда, тялото на този цикъл е непроменен.
		for (int i = 1; i < 5; i++) pr(lines, i);
		for (int i = 4; i > 0; i--) pr(lines, i);
		cout << endl;
	}

	// Паузираме програмата за да можем да видим резултата и излизаме със сигнал 0, без грешки.
	system("pause");
	return 0;
}

